; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v1 ?v13)
             (pred_3 ?v10 ?v4)
             (pred_6 ?v1 ?v4)
             (pred_1 ?v8 ?v1 )
	     (pred_8 ?v1)
             (pred_5 ?v2)
             (pred_7 ?v10)
             (pred_9 ?v4)
             (pred_10 ?v1)
             (pred_11 ?v10)
             (pred_12 ?v1)
             (pred_2 ))



(:action op_1
:parameters (?v9 ?v6 ?v12 ?v5)
:precondition (and (pred_5 ?v9) (pred_5 ?v6) (pred_7 ?v12) (pred_9 ?v5)
          (pred_4 ?v9 ?v6) (pred_3 ?v12 ?v5)
                   (pred_6 ?v6 ?v5) (pred_8 ?v9) 
                   (pred_10 ?v6) (pred_11 ?v12))
:effect (and  (pred_12 ?v6) (not (pred_10 ?v6))))


(:action op_3
:parameters (?v9 ?v11)
:precondition (and (pred_5 ?v9) (pred_5 ?v11)
               (pred_8 ?v9) (pred_4 ?v9 ?v11) (pred_12 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v9))))

(:action op_4
:parameters (?v9 ?v12)
:precondition (and (pred_5 ?v9) (pred_7 ?v12) 
                  (pred_8 ?v9) (pred_1 ?v12 ?v9) (pred_2 ))
:effect (and (pred_11 ?v12)
   (not (pred_1 ?v12 ?v9)) (not (pred_2 ))))


(:action op_2
:parameters (?v9 ?v7 ?v3)
:precondition (and (pred_5 ?v9) (pred_7 ?v7) (pred_7 ?v3)
                  (pred_8 ?v9) (pred_11 ?v3) (pred_1 ?v7 ?v9))
:effect (and (pred_11 ?v7) (pred_1 ?v3 ?v9)
        (not (pred_11 ?v3)) (not (pred_1 ?v7 ?v9))))

(:action op_5
:parameters (?v9 ?v12)
:precondition (and (pred_5 ?v9) (pred_7 ?v12) 
                  (pred_8 ?v9) (pred_11 ?v12))
:effect (and (pred_2 ) (pred_1 ?v12 ?v9) (not (pred_11 ?v12)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_04 obj_01 obj_08 obj_13 obj_02 obj_12 obj_07 obj_11
    obj_03 obj_09
    obj_05 obj_06
    )

    (:init
       (pred_2)

       (pred_5 obj_10)
       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_5 obj_02)
       (pred_5 obj_12)
       (pred_5 obj_07)
       (pred_5 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_09)
       (pred_7 obj_05)
       (pred_7 obj_06)

       (pred_4 obj_10 obj_08)
       (pred_4 obj_10 obj_04)
       (pred_4 obj_04 obj_13)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_04 obj_10)
       (pred_4 obj_01 obj_02)
       (pred_4 obj_01 obj_04)
       (pred_4 obj_08 obj_12)
       (pred_4 obj_08 obj_13)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_13 obj_07)
       (pred_4 obj_13 obj_02)
       (pred_4 obj_13 obj_04)
       (pred_4 obj_13 obj_08)
       (pred_4 obj_02 obj_11)
       (pred_4 obj_02 obj_01)
       (pred_4 obj_02 obj_13)
       (pred_4 obj_12 obj_07)
       (pred_4 obj_12 obj_08)
       (pred_4 obj_07 obj_11)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_12)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_11 obj_07)
       (pred_10 obj_04)
       (pred_10 obj_02)
       (pred_6  obj_04 obj_03)
       (pred_6  obj_02 obj_09)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_07)
       (pred_12 obj_11)

       (pred_3  obj_05 obj_03)
       (pred_3  obj_06 obj_09)
       (pred_1 obj_05 obj_12)
       (pred_1 obj_06 obj_10)
       (pred_8 obj_12)
    )

    (:goal (and
       (pred_1 obj_05 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_08)))
)
)

; plan
1. (op_4 obj_12 obj_05)
   deleted: (pred_1 obj_05 obj_12) (pred_2)
   added: (pred_11 obj_05)
   goals met: 0 of 1
2. (op_3 obj_12 obj_07)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_07)
   goals met: 0 of 1
3. (op_3 obj_07 obj_13)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_13)
   goals met: 0 of 1
4. (op_1 obj_13 obj_04 obj_05 obj_03)
   deleted: (pred_10 obj_04)
   added: (pred_12 obj_04)
   goals met: 0 of 1
5. (op_3 obj_13 obj_04)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_04)
   goals met: 0 of 1
6. (op_5 obj_04 obj_05)
   deleted: (pred_11 obj_05)
   added: (pred_2) (pred_1 obj_05 obj_04)
   goals met: 1 of 1
